{
     "temas": [
       {
          "id": 0,
         "title": "En tiempo real",
         "iconTitle": "En tiempo real",
         "text": [
           "Son sistemas diseñados para gestionar las críticas en el tiempo de manera predecible y confiable.",
           "Estos responden a tipos de entrada de forma extramadamente rápida, milésimas o millonésimas de segundos.",
           "Son necesarios para ejecutar equipos de diagnóstico médico, sistemas de apoyo a las funciones vitales, maquinarias, instrumentos científicos y sistemas industriales."
         ],
         "icon": "iconTiempoReal.png",
         "image": "realTime.png"
       },
       {
          "id": 1,
         "title": "De un solo usuario / una sola tarea",
         "iconTitle": "Una sola tarea",
         "text": [
           "Son un tipo de sistema operativo diseñado principalmente para entornos simples donde una única tarea se ejecuta en un solo usuario. ",
           "Solo permite que el usuario realice una tarea a la vez. Para un usuario, una tarea es una función como: imprimir, escribir, editar, o descargar un archivo.",
           "Para este tipo de sistemas, una tarea es un proceso, y su pequeñez y sencillez solo le permite controlar una sola a la vez."
         ],
         "icon": "iconSolaTarea.png",
         "image": "singleTask.jpg"
       },
       {
          "id": 2,
         "title": "De un solo usuario / multitareas",
         "iconTitle": "Un solo usuario",
         "text": [
           "Son un tipo de sistema operativo diseñado para servir a una única persona en un computadora personal.",
           "Estos sistemas permiten que un solo usuario ejecute múltiples aplicaciones y tareas al mismo tiempo, lo que mejora significativamente la eficiencia y la productividad.",
           "Ademas, estos sistemas suelen ofrecer interfaces de usuario intuitiva y gráficas, como ventanas y un entorno de escritorio, que facilitan la interaccion del usuario con las aplicaciones."
         ],
         "icon": "iconUSUMulti.png",
         "image": "multiTask.jpg"
       },
       {
          "id": 3,
        "title": "Multiusuario / multitareas",
        "iconTitle": "Multiusuario",
         "text": [
           "Son una categoría de sistemas operativos diseñados para admitir simultáneamente a varios usuarios y ejecutar múltiples tareas de manera eficiente en una misma computadora o servidor.",
           "Son escenciales en entornos donde se requiere el acceso concurrente a recursos compartdios, como servidores, mainframes y sistemas de red.",
           "Suelen contar con sistemas de autenticacíon y control de acceso robustos para proteger la privacidad y la seguridad de los datos de cada usuario."
         ],
         "icon": "iconMultiMulti.png",
         "image": "multiUser.jpg"
       }
     ]
   }